src/cf/src/InformationRegisters/РедакцииКоммерческихПредложений/РедакцииКоммерческихПредложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РедакцииКоммерческихПредложений</name>
  <comment>Снимки отправленных клиенту редакций коммерческого предложения: данные для возврата редакции и самодостаточные данные печати</comment>
  <resources>
    <name>Данные</name>
    <comment>Снимок: Структура «Объект» (шапка и товары) и «Печать» (данные печати на момент фиксации)</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Хеш</name>
    <comment>SHA-256 содержимого «Объект»: по нему решается, изменилось ли предложение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <comment>Момент фиксации редакции</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>DateTime</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Пользователь, записавший редакцию</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>Сумма предложения в редакции - для списка редакций</comment>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <comment>Валюта суммы редакции</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Предложение</name>
    <comment>Предложение, чья это редакция; ведущее - записи удаляются вместе с документом</comment>
    <type>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <comment>Номер редакции, с 1</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/InformationRegisters/РедакцииКоммерческихПредложений/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	// Архив редакций пишет только модуль объекта коммерческого предложения (флаг ЗаписьРедакцииКП), а записанная
	// редакция неизменна: повторная запись того же ключа отклоняется (docs/plans/kp-print-revisions.md, «Права и
	// защита архива»). Перед удалением документа редакции очищает сам документ (ПередУдалением); каскад платформы по
	// ведущему измерению Предложение потом пишет пустой набор - он пропускается, когда удалять уже нечего.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("ЗаписьРедакцииКП") И Не ПустойНаборБезРедакций() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстТолькоДокумент());
		Возврат;
	КонецЕсли;
	Если Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Редакции.Версия КАК Версия
	|ИЗ
	|	РегистрСведений.РедакцииКоммерческихПредложений КАК Редакции
	|ГДЕ
	|	Редакции.Предложение = &Предложение
	|	И Редакции.Версия В (&Версии)");
	Запрос.УстановитьПараметр("Предложение", ЭтотОбъект[0].Предложение);
	Запрос.УстановитьПараметр("Версии", ВыгрузитьКолонку("Версия"));
	Если Не Запрос.Выполнить().Пустой() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстРедакцияНеизменна());
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПустойНаборБезРедакций()
	Если Количество() > 0 Или Не Отбор.Предложение.Использование Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Редакции.Версия КАК Версия
	|ИЗ
	|	РегистрСведений.РедакцииКоммерческихПредложений КАК Редакции
	|ГДЕ
	|	Редакции.Предложение = &Предложение");
	Запрос.УстановитьПараметр("Предложение", Отбор.Предложение.Значение);
	// BSLLS:SetPrivilegedMode-off - только проверка наличия редакций удаляемого предложения: удаляющему нужно право
	// на документ, а не на чтение архива.
	УстановитьПривилегированныйРежим(Истина);
	// BSLLS:SetPrivilegedMode-on
	Пусто = Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	Возврат Пусто;
КонецФункции

Функция ТекстТолькоДокумент()
	Возврат НСтр("ru = 'Редакции коммерческого предложения записывает только сам документ.'; "
		+ "fr = 'Seul le devis lui-même enregistre ses révisions.'; "
		+ "en = 'Only the quotation itself writes its revisions.'; "
		+ "es = 'Solo el propio presupuesto registra sus revisiones.'");
КонецФункции

Функция ТекстРедакцияНеизменна()
	Возврат НСтр("ru = 'Записанная редакция коммерческого предложения не изменяется.'; "
		+ "fr = 'Une révision enregistrée du devis ne peut pas être modifiée.'; "
		+ "en = 'A saved quotation revision cannot be changed.'; "
		+ "es = 'Una revisión guardada del presupuesto no se modifica.'");
КонецФункции

#КонецОбласти
